; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-33)
(:domain gripper-strips)
(:objects rooma roomb left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 )
(:init
(room rooma)
(room roomb)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
(at ball32 rooma)
(at ball33 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
)
)
)

; plan
1. (pick ball33 rooma left)
   deleted: (at ball33 rooma) (free left)
   added: (carry ball33 left)
   goals met: 16 of 33
2. (pick ball32 rooma right)
   deleted: (at ball32 rooma) (free right)
   added: (carry ball32 right)
   goals met: 16 of 33
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 33
4. (drop ball32 roomb right)
   deleted: (carry ball32 right)
   added: (at ball32 roomb) (free right)
   goals met: 17 of 33
5. (drop ball33 roomb left)
   deleted: (carry ball33 left)
   added: (at ball33 roomb) (free left)
   goals met: 18 of 33
6. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 18 of 33
7. (pick ball31 rooma left)
   deleted: (at ball31 rooma) (free left)
   added: (carry ball31 left)
   goals met: 18 of 33
8. (pick ball30 rooma right)
   deleted: (at ball30 rooma) (free right)
   added: (carry ball30 right)
   goals met: 18 of 33
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 18 of 33
10. (drop ball30 roomb right)
   deleted: (carry ball30 right)
   added: (at ball30 roomb) (free right)
   goals met: 19 of 33
11. (drop ball31 roomb left)
   deleted: (carry ball31 left)
   added: (at ball31 roomb) (free left)
   goals met: 20 of 33
12. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 20 of 33
13. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 20 of 33
14. (pick ball28 rooma right)
   deleted: (at ball28 rooma) (free right)
   added: (carry ball28 right)
   goals met: 20 of 33
15. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 20 of 33
16. (drop ball28 roomb right)
   deleted: (carry ball28 right)
   added: (at ball28 roomb) (free right)
   goals met: 21 of 33
17. (drop ball29 roomb left)
   deleted: (carry ball29 left)
   added: (at ball29 roomb) (free left)
   goals met: 22 of 33
18. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 22 of 33
19. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 22 of 33
20. (pick ball26 rooma right)
   deleted: (at ball26 rooma) (free right)
   added: (carry ball26 right)
   goals met: 22 of 33
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 22 of 33
22. (drop ball26 roomb right)
   deleted: (carry ball26 right)
   added: (at ball26 roomb) (free right)
   goals met: 23 of 33
23. (drop ball27 roomb left)
   deleted: (carry ball27 left)
   added: (at ball27 roomb) (free left)
   goals met: 24 of 33
24. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 33
25. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 24 of 33
26. (pick ball24 rooma right)
   deleted: (at ball24 rooma) (free right)
   added: (carry ball24 right)
   goals met: 24 of 33
27. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 33
28. (drop ball24 roomb right)
   deleted: (carry ball24 right)
   added: (at ball24 roomb) (free right)
   goals met: 25 of 33
29. (drop ball25 roomb left)
   deleted: (carry ball25 left)
   added: (at ball25 roomb) (free left)
   goals met: 26 of 33
30. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 26 of 33
31. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 26 of 33
32. (pick ball22 rooma right)
   deleted: (at ball22 rooma) (free right)
   added: (carry ball22 right)
   goals met: 26 of 33
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 33
34. (drop ball22 roomb right)
   deleted: (carry ball22 right)
   added: (at ball22 roomb) (free right)
   goals met: 27 of 33
35. (drop ball23 roomb left)
   deleted: (carry ball23 left)
   added: (at ball23 roomb) (free left)
   goals met: 28 of 33
36. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 28 of 33
37. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 28 of 33
38. (pick ball20 rooma right)
   deleted: (at ball20 rooma) (free right)
   added: (carry ball20 right)
   goals met: 28 of 33
39. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 28 of 33
40. (drop ball20 roomb right)
   deleted: (carry ball20 right)
   added: (at ball20 roomb) (free right)
   goals met: 29 of 33
41. (drop ball21 roomb left)
   deleted: (carry ball21 left)
   added: (at ball21 roomb) (free left)
   goals met: 30 of 33
42. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 30 of 33
43. (pick ball19 rooma left)
   deleted: (at ball19 rooma) (free left)
   added: (carry ball19 left)
   goals met: 30 of 33
44. (pick ball18 rooma right)
   deleted: (at ball18 rooma) (free right)
   added: (carry ball18 right)
   goals met: 30 of 33
45. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 33
46. (drop ball18 roomb right)
   deleted: (carry ball18 right)
   added: (at ball18 roomb) (free right)
   goals met: 31 of 33
47. (drop ball19 roomb left)
   deleted: (carry ball19 left)
   added: (at ball19 roomb) (free left)
   goals met: 32 of 33
48. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 33
49. (pick ball17 rooma left)
   deleted: (at ball17 rooma) (free left)
   added: (carry ball17 left)
   goals met: 32 of 33
50. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 33
51. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 33 of 33
